TestEDT/src/Catalogs/уа_ИсточникиДанных/уа_ИсточникиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уа_ИсточникиДанных</name>
  <predefined>
    <items>
      <name>RuData</name>
      <description>Ru:DATA</description>
    </items>
    <items>
      <name>MOEX</name>
      <description>Московская биржа</description>
    </items>
  </predefined>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтрокуСоединения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВнешнегоИсточника</name>
    <type>
      <types>EnumRef.ВидыВнешнихИсточников</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияСтандартная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TestEDT/src/Catalogs/уа_ИсточникиДанных/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		УникальныйИдентификаторСсылки = Строка(Объект.Ссылка.УникальныйИдентификатор());
		
		ПарольБезопасноеХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(УникальныйИдентификаторСсылки, "Пароль");
		Пароль = ?(ЗначениеЗаполнено(ПарольБезопасноеХранилище), ЭтотОбъект.УникальныйИдентификатор, "");
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ИспользоватьСтрокуСоединения Тогда
		
		ТекущийОбъект.Сервер = "";
		ТекущийОбъект.ИмяПользователя = "";
		ТекущийОбъект.БазаДанных = "";
		ТекущийОбъект.ДрайверПодключения = "";
		
		Пароль = "";
		ПарольИзменен = Истина;
		
	Иначе 
		
		ТекущийОбъект.СтрокаСоединения = "";
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПарольИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		УникальныйИдентификаторСсылки = Строка(ТекущийОбъект.Ссылка.УникальныйИдентификатор());
		
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(УникальныйИдентификаторСсылки, Пароль, "Пароль");
		
		УстановитьПривилегированныйРежим(Ложь);
		
		ПарольИзменен = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПарольИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПарольИзменен = Истина;
    Пароль = Текст;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтрокуПодключенияПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ИспользоватьСтрокуПодключения = Объект.ИспользоватьСтрокуСоединения;
	
	Элементы.ГруппаДанныеСоединения.Видимость = Не ИспользоватьСтрокуПодключения;
	Элементы.ГруппаСтрокаСоединения.Видимость = ИспользоватьСтрокуПодключения;
	
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияОСПриИзменении(Элемент)
	//Объект.АутентификацияСтандартная = Не Объект.АутентификацияОС;
КонецПроцедуры

&НаКлиенте
Процедура АутентификацияСтандартнаяПриИзменении(Элемент)
	//Объект.АутентификацияОС = Не Объект.АутентификацияСтандартная;
КонецПроцедуры

#КонецОбласти
